app/Models/componenteModel.php

SELECT `componente`.`NOMBRE_COMPONENTE`, `componente`.`ICONO` AS `ICONO_COMPONENTE`, `componente`.`RUTA`, `modulo`.`ID_MODULO`
FROM `componente`
JOIN `modulo` ON `modulo`.`ID_MODULO` = `componente`.`ID_MODULO`
JOIN `permisos_componentes` ON `permisos_componentes`.`ID_componente` = `componente`.`ID_componente`
JOIN `rol` ON `permisos_componentes`.`ID_ROL` = `rol`.`ID_ROL`
JOIN `usuario` ON `rol`.`ID_ROL` = `usuario`.`ID_ROL`
WHERE `permisos_componentes`.`VISTA` = 1
AND `usuario`.`ID` = (1)
---
    public function listarcomponentesAutorizados($id)
    {
        $db = $this->db;
        $query = $db->table('componente')
            ->select(['componente.NOMBRE_COMPONENTE', 'componente.ICONO AS ICONO_COMPONENTE', 'componente.RUTA', 'modulo.ID_MODULO'])
            ->join('modulo','modulo.ID_MODULO = componente.ID_MODULO')
            ->join('permisos_componentes', 'permisos_componentes.ID_componente = componente.ID_componente')
            ->join('rol', 'permisos_componentes.ID_ROL = rol.ID_ROL')
            ->join('usuario', 'rol.ID_ROL = usuario.ID_ROL')
            ->where('permisos_componentes.VISTA', 1)
            ->where('usuario.ID', $id)
            ->get();