app/Models/moduloModel.php

    public function listarModulosAutorizados($id)
    {
        $db = $this->db;
        $query = $db->table('modulo')
            ->select(['modulo.TITULO', 'modulo.ICONO', 'modulo.ID_MODULO'])
            ->join('componente', 'modulo.ID_MODULO = componente.ID_MODULO')
            ->join('permisos_componentes', 'permisos_componentes.ID_componente = componente.ID_componente')
            ->join('rol', 'permisos_componentes.ID_ROL = rol.ID_ROL')
            ->join('usuario', 'rol.ID_ROL = usuario.ID_ROL')
            ->where('permisos_componentes.VISTA', 1)
            ->where('usuario.ID', $id)
            ->groupBy('ID_MODULO')
            ->get();
        return  $query->getResult();
---
SELECT `modulo`.`TITULO`, `modulo`.`ICONO`, `modulo`.`ID_MODULO`
FROM `modulo`
JOIN `componente` ON `modulo`.`ID_MODULO` = `componente`.`ID_MODULO`
JOIN `permisos_componentes` ON `permisos_componentes`.`ID_componente` = `componente`.`ID_componente`
JOIN `rol` ON `permisos_componentes`.`ID_ROL` = `rol`.`ID_ROL`
JOIN `usuario` ON `rol`.`ID_ROL` = `usuario`.`ID_ROL`
WHERE `permisos_componentes`.`VISTA` = 1
AND `usuario`.`ID` = (1)
GROUP BY `ID_MODULO`
SELECT `modulo`.`TITULO`, `modulo`.`ICONO`, `modulo`.`ID_MODULO`
FROM `modulo`
JOIN `componente` ON `modulo`.`ID_MODULO` = `componente`.`ID_MODULO`
JOIN `permisos_componentes` ON `permisos_componentes`.`ID_componente` = `componente`.`ID_componente`
JOIN `rol` ON `permisos_componentes`.`ID_ROL` = `rol`.`ID_ROL`
JOIN `usuario` ON `rol`.`ID_ROL` = `usuario`.`ID_ROL`
WHERE `permisos_componentes`.`VISTA` = 1
AND `usuario`.`ID` = (1)