app/Models/usuarioModel.php

    public function obtenerUsuarioPorCorreo($correo)
    {
        $query = $this->db->table('usuario')
                          ->select('usuario.*, rol.DESCRIPCION as ROL_DESCRIPCION')
                          ->join('rol', 'rol.ID_ROL = usuario.ID_ROL', 'left')
                          ->where('usuario.CORREO', $correo)
                          ->get();

        return $query->getRowArray();
---
SELECT `usuario`.*, `rol`.`DESCRIPCION` as `ROL_DESCRIPCION`
FROM `usuario`
LEFT JOIN `rol` ON `rol`.`ID_ROL` = `usuario`.`ID_ROL`
WHERE `usuario`.`CORREO` = 'Camilo@example.com'
SELECT *
FROM `usuario`
WHERE `CORREO` = ('santiago@example.com')

    public function listarUsuarios()
    {
        $query = $this->select(['NOMBRE', 'APELLIDO', 'CORREO', 'IMG_URL', 'DESCRIPCION'])
            ->join('rol', 'usuario.ID_ROL = rol.ID_ROL')
            ->get();
---
SELECT `NOMBRE`, `APELLIDO`, `CORREO`, `IMG_URL`, `DESCRIPCION`
FROM `usuario`
JOIN `rol` ON `usuario`.`ID_ROL` = `rol`.`ID_ROL`